app/Controllers/AdminController.php

SELECT SUM(`total_amount`) AS `total_amount`
FROM `orders`
WHERE `status` != 'cancelled'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `vendors`
WHERE `approval_status` = 'approved'
SELECT COUNT(*) AS `numrows`
FROM `products`
SELECT COUNT(*) AS `numrows`
FROM `orders`
SELECT COUNT(*) AS `numrows`
FROM `vendors`
WHERE `approval_status` = 'pending'
---
    public function dashboard()
    {
        $vendorModel = new VendorModel();
        $productModel = new ProductModel();
        $orderModel = new OrderModel();
        $userModel = new UserModel();

        // Sum all orders that haven't been cancelled
        $revenue = $orderModel->selectSum('total_amount')->where('status !=', 'cancelled')->first();

        $data = [
            'total_vendors'  => $vendorModel->where('approval_status', 'approved')->countAllResults(),
            'total_products' => $productModel->countAllResults(),
            'total_orders'   => $orderModel->countAllResults(),
            'total_revenue'  => $revenue['total_amount'] ?? 0.00,
            'pending_vendors'=> $vendorModel->where('approval_status', 'pending')->countAllResults()
        ];

SELECT `vendors`.*, `users`.`email`, `users`.`name`
FROM `vendors`
JOIN `users` ON `users`.`id` = `vendors`.`user_id`
---
    public function vendors()
    {
        $vendorModel = new VendorModel();
        // Join with users to get email and name
        $data['vendors'] = $vendorModel->select('vendors.*, users.email, users.name')
                                       ->join('users', 'users.id = vendors.user_id')
                                       ->findAll();

SELECT *
FROM `users`
WHERE `role` = 'customer'
---
    public function users()
    {
        $userModel = new \App\Models\UserModel();
        // Only fetch users who have the 'customer' role
        $data['users'] = $userModel->where('role', 'customer')->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
UPDATE `users` SET `status` = 1
WHERE `users`.`id` IN ('2')
---
    public function toggleUserStatus($userId)
    {
        $userModel = new UserModel();
        $user = $userModel->find($userId);
        if ($user) {
            $newStatus = ($user['status'] == 1) ? 0 : 1;
            $userModel->update($userId, ['status' => $newStatus]);

SELECT *
FROM `categories`
---
    public function categories()
    {
        $categoryModel = new CategoryModel();
        $data['categories'] = $categoryModel->findAll();

INSERT INTO `categories` (`name`, `status`) VALUES ('A', 1)
---
    public function addCategory()
    {
        $categoryModel = new CategoryModel();
        $name = $this->request->getPost('name');

        if (!empty($name)) {
            $categoryModel->insert(['name' => $name, 'status' => 1]);

SELECT `products`.*, `vendors`.`store_name`, `categories`.`name` as `category_name`
FROM `products`
JOIN `vendors` ON `vendors`.`user_id` = `products`.`vendor_id`
JOIN `categories` ON `categories`.`id` = `products`.`category_id`
---
    public function products()
    {
        $productModel = new ProductModel();
        $data['products'] = $productModel->select('products.*, vendors.store_name, categories.name as category_name')
                                         ->join('vendors', 'vendors.user_id = products.vendor_id')
                                         ->join('categories', 'categories.id = products.category_id')
                                         ->findAll();

SELECT `orders`.*, `users`.`name` as `customer_name`
FROM `orders`
JOIN `users` ON `users`.`id` = `orders`.`customer_id`
ORDER BY `orders`.`created_at` DESC
---
    public function orders()
    {
        $orderModel = new OrderModel();
        $data['orders'] = $orderModel->select('orders.*, users.name as customer_name')
                                     ->join('users', 'users.id = orders.customer_id')
                                     ->orderBy('orders.created_at', 'DESC')
                                     ->findAll();