app/Controllers/AdminController.php

SELECT `orders`.*, `users`.`name` as `customer_name`
FROM `orders`
JOIN `users` ON `users`.`id` = `orders`.`customer_id`
ORDER BY `orders`.`created_at` DESC
---
    public function orders()
    {
        $orderModel = new OrderModel();
        $data['orders'] = $orderModel->select('orders.*, users.name as customer_name')
                                     ->join('users', 'users.id = orders.customer_id')
                                     ->orderBy('orders.created_at', 'DESC')
                                     ->findAll();