app/Controllers/Checkout.php

INSERT INTO `orders` (`customer_id`, `total_amount`, `status`, `created_at`) VALUES ('2', 45, 'processing', '2026-02-23 16:35:11')
---
    public function processCheckout()
    {
        $session = session();
        $cart = $session->get('cart'); // Assuming cart is stored in session as an array of items

        if (empty($cart)) {
            return redirect()->back()->with('error', 'Cart is empty');
        }

        $db = \Config\Database::connect();
        $db->transStart(); // START TRANSACTION

        try {
            // 1. Calculate overall total
            $totalAmount = array_reduce($cart, function($sum, $item) {
                return $sum + ($item['price'] * $item['quantity']);
            }, 0);

            // 2. Create Main Order Record
            $orderModel = new OrderModel();
            $orderId = $orderModel->insert([
                'customer_id'  => $session->get('user_id'),
                'total_amount' => $totalAmount,
                'status'       => 'processing',
                'created_at'   => date('Y-m-d H:i:s')
            ]);

INSERT INTO `order_items` (`order_id`, `product_id`, `vendor_id`, `price`, `quantity`) VALUES (3, 3, 3, '45.00', 1)
UPDATE `products` SET `stock` = stock - 1
WHERE `id` = 3
---

            foreach ($cart as $item) {
                // Insert individual order items tracking the vendor
                $orderItemModel->insert([
                    'order_id'   => $orderId,
                    'product_id' => $item['product_id'],
                    'vendor_id'  => $item['vendor_id'],
                    'price'      => $item['price'],
                    'quantity'   => $item['quantity']
                ]);

                // Reduce Stock dynamically
                $productModel->set('stock', 'stock - ' . (int)$item['quantity'], false)
                             ->where('id', $item['product_id'])
                             ->update();

INSERT INTO `payments` (`order_id`, `amount`, `payment_status`, `created_at`) VALUES (3, 45, 'paid', '2026-02-23 16:35:11')
---

            // 4. Create Payment Simulation Record
            $paymentModel = new PaymentModel();
            $paymentModel->insert([
                'order_id'       => $orderId,
                'amount'         => $totalAmount,
                'payment_status' => 'paid', // Simulated as paid immediately
                'created_at'     => date('Y-m-d H:i:s')
            ]);