app/Controllers/ShopController.php

SELECT *
FROM `categories`
WHERE `status` = 1
SELECT *
FROM `products`
WHERE `status` = 1
AND `stock` > 0
---
    public function index()
    {
        $productModel = new ProductModel();
        $categoryModel = new CategoryModel();

        $data['categories'] = $categoryModel->where('status', 1)->findAll();
        // Only show active products that are in stock
        $data['products'] = $productModel->where('status', 1)
                                         ->where('stock >', 0)
                                         ->findAll();

SELECT *
FROM `products`
WHERE `status` = 1
AND `stock` > 0
AND `category_id` = '1'
---
    public function filterProducts()
    {
        $categoryId = $this->request->getGet('category_id');
        $productModel = new ProductModel();

        $query = $productModel->where('status', 1)->where('stock >', 0);

        // If a specific category is selected (not "All")
        if (!empty($categoryId) && $categoryId !== 'all') {
            $query->where('category_id', $categoryId);
        }

        $products = $query->findAll();

SELECT *
FROM `products`
WHERE `products`.`id` = 3
---
    public function addToCart()
    {
        $session = session();
        $cart = $session->get('cart') ?? [];

        // Strict type casting to prevent payload manipulation
        $productId = (int) $this->request->getPost('product_id');
        $vendorId  = (int) $this->request->getPost('vendor_id');
        $quantity  = (int) $this->request->getPost('quantity') ?: 1;

        $productModel = new ProductModel();
        $product = $productModel->find($productId);