app/Controllers/VendorController.php

    public function dashboard()
    {
        $productModel = new ProductModel();
        $orderItemModel = new OrderItemModel();

        // Strict Isolation: Only get stats for THIS vendor
        $totalProducts = $productModel->where('vendor_id', $this->vendorId)->countAllResults();

        $salesData = $orderItemModel->selectSum('quantity')
                                    ->selectSum('price') // Price here represents total line item price
                                    ->where('vendor_id', $this->vendorId)
                                    ->first();
---
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `vendor_id` = '3'
SELECT SUM(`quantity`) AS `quantity`, SUM(`price`) AS `price`
FROM `order_items`
WHERE `vendor_id` = '3'
 LIMIT 1

    public function updateOrderStatus($itemId)
    {
        $orderItemModel = new \App\Models\OrderItemModel();

        // Strict Isolation: Ensure the vendor owns this specific order item
        $item = $orderItemModel->where('vendor_id', session()->get('user_id'))->find($itemId);

        if ($item) {
            $status = $this->request->getPost('status');
            $orderItemModel->update($itemId, ['status' => $status]);
---
SELECT *
FROM `order_items`
WHERE `vendor_id` = '3'
AND `order_items`.`id` = '6'
UPDATE `order_items` SET `status` = 'delivered'
WHERE `order_items`.`id` IN ('6')

    public function orders()
    {
        $orderItemModel = new OrderItemModel();
        // Join with main orders table to get status, and products to get the name
        $data['order_items'] = $orderItemModel->select('order_items.*, orders.status, orders.created_at, products.name as product_name')
                                              ->join('orders', 'orders.id = order_items.order_id')
                                              ->join('products', 'products.id = order_items.product_id')
                                              ->where('order_items.vendor_id', $this->vendorId)
                                              ->orderBy('orders.created_at', 'DESC')
                                              ->findAll();
---
SELECT `order_items`.*, `orders`.`status`, `orders`.`created_at`, `products`.`name` as `product_name`
FROM `order_items`
JOIN `orders` ON `orders`.`id` = `order_items`.`order_id`
JOIN `products` ON `products`.`id` = `order_items`.`product_id`
WHERE `order_items`.`vendor_id` = '3'
ORDER BY `orders`.`created_at` DESC